app/Controllers/DasboardController.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Models
        $barangModel = new \App\Models\BarangModel();
        $kendaraanModel = new \App\Models\KendaraanModel();
        $penggunaModel = new \App\Models\PenggunaModel();
        $pemakaianModel = new \App\Models\PemakaianModel();

        // ==== TOTAL ASET (Barang + Kendaraan) ====
    $totalBarang = $barangModel->where('status !=', 'habis terpakai')->countAllResults();
        $totalKendaraan = $kendaraanModel->countAll();
        $totalAset = $totalBarang + $totalKendaraan;

        // ==== TOTAL NILAI ASET (Barang + Kendaraan) ====
        $nilaiBarang = $barangModel->selectSum('harga_barang')->first()['harga_barang'] ?? 0;
        $nilaiKendaraan = $kendaraanModel->selectSum('harga')->first()['harga'] ?? 0;
        $totalNilaiAset = $nilaiBarang + $nilaiKendaraan;

        // ==== ASET PER KATEGORI (Hanya Barang) ====
    $builder = $db->table('barang');
    $builder->select('kategori.nama_kategori, COUNT(barang.id) as jumlah');
    $builder->join('asset', 'asset.id = barang.id_asset');
    $builder->join('kategori', 'kategori.kode_kategori = asset.kode_kategori');
    $builder->where('barang.status !=', 'habis terpakai');
    $builder->groupBy('kategori.nama_kategori');
    $barangPerKategori = $builder->get()->getResultArray();

        // ==== KENDARAAN (Untuk statistik kendaraan dinas saja) ====
        $kendaraanMobil = $kendaraanModel->where('model_kendaraan', 'mobil')->countAllResults();
        $kendaraanMotor = $kendaraanModel->where('model_kendaraan', 'motor')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `status` != 'habis terpakai'
SELECT COUNT(*) AS `numrows` FROM `kendaraan`
SELECT SUM(`harga_barang`) AS `harga_barang`
FROM `barang`
 LIMIT 1
SELECT SUM(`harga`) AS `harga`
FROM `kendaraan`
 LIMIT 1
SELECT `kategori`.`nama_kategori`, COUNT(barang.id) as jumlah
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
JOIN `kategori` ON `kategori`.`kode_kategori` = `asset`.`kode_kategori`
WHERE `barang`.`status` != 'habis terpakai'
GROUP BY `kategori`.`nama_kategori`
SELECT COUNT(*) AS `numrows`
FROM `kendaraan`
WHERE `model_kendaraan` = 'mobil'
SELECT COUNT(*) AS `numrows`
FROM `kendaraan`
WHERE `model_kendaraan` = 'motor'

        $userBarangBuilder->select('pengguna.id');
        $userBarangBuilder->join('barang', 'barang.id_pengguna = pengguna.id');
        $userBarangBuilder->distinct();
        $userWithBarang = $userBarangBuilder->get()->getResultArray();
---
SELECT DISTINCT `pengguna`.`id`
FROM `pengguna`
JOIN `barang` ON `barang`.`id_pengguna` = `pengguna`.`id`

        $userKendaraanBuilder->select('pengguna.id');
        $userKendaraanBuilder->join('kendaraan', 'kendaraan.id_pengguna = pengguna.id');
        $userKendaraanBuilder->distinct();
        $userWithKendaraan = $userKendaraanBuilder->get()->getResultArray();
---
SELECT DISTINCT `pengguna`.`id`
FROM `pengguna`
JOIN `kendaraan` ON `kendaraan`.`id_pengguna` = `pengguna`.`id`

        $allActiveUserIds = array_unique(array_merge($userBarangIds, $userKendaraanIds));
        $penggunaAktif = count($allActiveUserIds);

        // ==== TOTAL PEMAKAIAN (Barang + Kendaraan) ====
        $totalPemakaianBarang = $pemakaianModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pemakaian`