app/Controllers/DataAssetsController.php

    public function index()
    {
        $subKategoriModel = new SubKategoriModel();
        $kategoriModel = new \App\Models\KategoriModel();

        // Ambil parameter filter dari GET request
        $selected_kategori = $this->request->getGet('kategori');

        // Ambil semua kategori untuk dropdown filter
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`

    public function detailSubKategori($kode_sub_kategori)
    {
        $barangModel = new \App\Models\BarangModel();
        $subKategoriModel = new \App\Models\SubKategoriModel();
        $assetModel = new \App\Models\AssetModel();
        $pemakaianModel = new \App\Models\PemakaianModel();

        // Ambil filter dari GET request
        $namaBarang = $this->request->getGet('nama_barang');

        // Query barang berdasarkan sub kategori + filter nama_barang jika ada
        $query = $barangModel
            ->select('barang.*, asset.kode_barang, asset.nama_barang, asset.kode_kategori, asset.kode_sub_kategori, pengguna.nama_pengguna, lokasi.nama_lokasi')
            ->join('asset', 'asset.id = barang.id_asset')
            ->join('pengguna', 'pengguna.id = barang.id_pengguna', 'left')
            ->join('lokasi', 'lokasi.id = barang.id_lokasi', 'left')
            ->where('asset.kode_sub_kategori', $kode_sub_kategori);

        if (!empty($namaBarang)) {
            $query->where('asset.nama_barang', $namaBarang);
        }

        $barangList = $query->orderBy('asset.nama_barang', 'ASC')->findAll();

        // Ambil daftar nama barang unik untuk dropdown filter (tetap hanya berdasarkan sub kategori)
        $nama_barang_list = $barangModel
            ->select('DISTINCT(asset.nama_barang)')
            ->join('asset', 'asset.id = barang.id_asset')
            ->where('asset.kode_sub_kategori', $kode_sub_kategori)
            ->orderBy('asset.nama_barang', 'ASC')
            ->findAll();

        // Ambil info sub kategori + kategori dari salah satu barang (mengikuti filter nama_barang)
        $sub_kategori = $subKategoriModel
            ->select('sub_kategori.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori')
            ->where('sub_kategori.kode_sub_kategori', $kode_sub_kategori)
            ->first();
---
SELECT `barang`.*, `asset`.`kode_barang`, `asset`.`nama_barang`, `asset`.`kode_kategori`, `asset`.`kode_sub_kategori`, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
WHERE `asset`.`kode_sub_kategori` = 'SK14'
ORDER BY `asset`.`nama_barang` ASC
SELECT DISTINCT(asset.nama_barang)
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
WHERE `asset`.`kode_sub_kategori` = 'SK14'
ORDER BY `asset`.`nama_barang` ASC
SELECT `sub_kategori`.*, `kategori`.`nama_kategori`
FROM `sub_kategori`
JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
WHERE `sub_kategori`.`kode_sub_kategori` = 'SK14'
 LIMIT 1

    public function edit($id)
    {
        $barangModel = new BarangModel();
        $lokasiModel = new \App\Models\LokasiModel();
        $penggunaModel = new \App\Models\PenggunaModel();

        $barang = $barangModel->select('barang.*, asset.kode_sub_kategori, asset.kode_kategori, asset.nama_barang')
                          ->join('asset', 'asset.id = barang.id_asset')
                          ->where('barang.id', $id)
                          ->first();
---
SELECT `barang`.*, `asset`.`kode_sub_kategori`, `asset`.`kode_kategori`, `asset`.`nama_barang`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
WHERE `barang`.`id` = '229'
 LIMIT 1

        $data = [
            'menu' => 'dataassets',
            'barang' => $barang,
            'lokasi' => $lokasiModel->findAll(),
            'pengguna' => $penggunaModel->findAll(),
---
SELECT *
FROM `lokasi`
SELECT *
FROM `pengguna`

    public function update($id)
    {
        $barangModel = new BarangModel();
        $pemakaianModel = new PemakaianModel();
        $assetModel = new AssetModel();

        // Ambil data barang berdasarkan ID untuk validasi
        $barang = $barangModel->select('barang.*, asset.kode_sub_kategori, asset.kode_kategori, asset.nama_barang')
                              ->join('asset', 'asset.id = barang.id_asset')
                              ->where('barang.id', $id)
                              ->first();
---
SELECT `barang`.*, `asset`.`kode_sub_kategori`, `asset`.`kode_kategori`, `asset`.`nama_barang`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
WHERE `barang`.`id` = '229'
 LIMIT 1

        if ($id_pengguna_baru != $barang['id_pengguna']) {
            // Catat riwayat pemilik
            $riwayatModel = new \App\Models\RiwayatModel();
            $riwayatModel->insert([
                'id_asset' => $barang['id_asset'],
                'id_barang' => $barang['id'],
                'id_pengguna' => $id_pengguna_baru,
                'tanggal_mulai' => $tanggal_perubahan ? date('Y-m-d', strtotime($tanggal_perubahan)) : date('Y-m-d'),
                'keterangan' => 'Perubahan pemilik barang',
            ]);
        }

        // Update data barang
        $barangModel->update($id, $data);

        // Update langsung data pemakaian yang terkait dengan asset ini
        $db = \Config\Database::connect();
        $db->table('pemakaian')
            ->where('id_asset', $barang['id_asset'])
            ->update([
                'id_pengguna' => $id_pengguna_baru,
                'id_lokasi' => $this->request->getPost('id_lokasi')
            ]);
---
INSERT INTO `riwayat` (`id_asset`, `id_barang`, `id_pengguna`, `tanggal_mulai`, `keterangan`) VALUES ('146', '229', '19', '2025-08-25', 'Perubahan pemilik barang')
UPDATE `barang` SET `status` = 'terpakai', `id_lokasi` = '18', `id_pengguna` = '19'
WHERE `barang`.`id` IN ('229')
UPDATE `pemakaian` SET `id_pengguna` = '19', `id_lokasi` = '18'
WHERE `id_asset` = '146'

    public function detail($id)
    {
        $barangModel = new BarangModel();
        $pemakaianModel = new PemakaianModel();
        $assetModel = new AssetModel();

        $barang = $barangModel
        ->select('barang.*, asset.kode_sub_kategori, asset.nama_barang, asset.kode_barang, asset.kode_kategori, asset.jumlah_barang, pengguna.nama_pengguna, lokasi.nama_lokasi')
        ->join('asset', 'asset.id = barang.id_asset')
        ->join('pengguna', 'pengguna.id = barang.id_pengguna', 'left')
        ->join('lokasi', 'lokasi.id = barang.id_lokasi', 'left')
        ->where('barang.id', $id)
        ->first();

        if (!$barang) {
            return redirect()->to('/dataassets')->with('error', 'Data barang tidak ditemukan.');
        }

        // Ambil data riwayat dari tabel pemakaian untuk asset ini
        $riwayat = $pemakaianModel
            ->select('pemakaian.*, pengguna.nama_pengguna, lokasi.nama_lokasi')
            ->join('pengguna', 'pengguna.id = pemakaian.id_pengguna', 'left')
            ->join('lokasi', 'lokasi.id = pemakaian.id_lokasi', 'left')
            ->where('pemakaian.id_asset', $barang['id_asset'])
            ->orderBy('pemakaian.tanggal_mulai', 'DESC')
            ->findAll();
---
SELECT `barang`.*, `asset`.`kode_sub_kategori`, `asset`.`nama_barang`, `asset`.`kode_barang`, `asset`.`kode_kategori`, `asset`.`jumlah_barang`, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
WHERE `barang`.`id` = '229'
 LIMIT 1
SELECT `pemakaian`.*, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `pemakaian`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `pemakaian`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `pemakaian`.`id_lokasi`
WHERE `pemakaian`.`id_asset` = '146'
ORDER BY `pemakaian`.`tanggal_mulai` DESC