app/Controllers/LaporanController.php

    public function kendaraan()
    {
        $model = model('App\Models\KendaraanModel');
        // Join pengguna dan lokasi
        $data['kendaraan'] = $model
            ->select('kendaraan.*, pengguna.nama_pengguna, lokasi.nama_lokasi')
            ->join('pengguna', 'pengguna.id = kendaraan.id_pengguna', 'left')
            ->join('lokasi', 'lokasi.id = kendaraan.id_lokasi', 'left')
            ->findAll();
---
SELECT `kendaraan`.*, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `kendaraan`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `kendaraan`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `kendaraan`.`id_lokasi`