app/Controllers/LokasiController.php

SELECT *
FROM `lokasi`
---
    public function lokasi()
    {
        $data = [
            'menu' => 'lokasi',
            'lokasi' => $this->modelLokasi->findAll(),