app/Models/AssetModel.php

    public function getAssetWithKategoriPaginated($perPage = 10)
    {
        return $this->select('asset.*, kategori.kode_kategori, kategori.nama_kategori, sub_kategori.nama_sub_kategori')
                    ->join('kategori', 'kategori.kode_kategori = asset.kode_kategori', 'left')
                    ->join('sub_kategori', 'sub_kategori.kode_sub_kategori = asset.kode_sub_kategori', 'left')
                    ->findAll();
---
SELECT `asset`.*, `kategori`.`kode_kategori`, `kategori`.`nama_kategori`, `sub_kategori`.`nama_sub_kategori`
FROM `asset`
LEFT JOIN `kategori` ON `kategori`.`kode_kategori` = `asset`.`kode_kategori`
LEFT JOIN `sub_kategori` ON `sub_kategori`.`kode_sub_kategori` = `asset`.`kode_sub_kategori`