app/Models/BarangModel.php

    public function getBarangWithAssetLocationPenggunaBySubKategori($kode_sub_kategori)
    {
        return $this->select('barang.*, asset.kode_barang, asset.nama_barang, asset.kode_kategori, asset.kode_sub_kategori, pengguna.nama_pengguna, lokasi.nama_lokasi')
                    ->join('asset', 'asset.id = barang.id_asset')
                    ->join('pengguna', 'pengguna.id = barang.id_pengguna', 'left')
                    ->join('lokasi', 'lokasi.id = barang.id_lokasi', 'left')
                    ->where('asset.kode_sub_kategori', $kode_sub_kategori)
                    ->orderBy('asset.nama_barang', 'ASC')
                    ->findAll();
---
SELECT `barang`.*, `asset`.`kode_barang`, `asset`.`nama_barang`, `asset`.`kode_kategori`, `asset`.`kode_sub_kategori`, `pengguna`.`nama_pengguna`, `lokasi`.`nama_lokasi`
FROM `barang`
JOIN `asset` ON `asset`.`id` = `barang`.`id_asset`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `barang`.`id_pengguna`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `barang`.`id_lokasi`
WHERE `asset`.`kode_sub_kategori` = 'SK05'
ORDER BY `asset`.`nama_barang` ASC