app/Models/PemakaianModel.php

SELECT `pemakaian`.*, `asset`.`nama_barang`, `asset`.`kode_barang`, `asset`.`kode_kategori`, `kategori`.`nama_kategori`, `asset`.`kode_sub_kategori`, `sub_kategori`.`nama_sub_kategori`, `lokasi`.`nama_lokasi`, `pengguna`.`nama_pengguna`
FROM `pemakaian`
JOIN `asset` ON `asset`.`id` = `pemakaian`.`id_asset`
LEFT JOIN `kategori` ON `kategori`.`kode_kategori` = `asset`.`kode_kategori`
LEFT JOIN `sub_kategori` ON `sub_kategori`.`kode_sub_kategori` = `asset`.`kode_sub_kategori`
LEFT JOIN `lokasi` ON `lokasi`.`id` = `pemakaian`.`id_lokasi`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `pemakaian`.`id_pengguna`
WHERE YEAR(pemakaian.tanggal_mulai) = '2025'
---
public function getPemakaianWithAsset($tahun = null, $kategori = null, $subKategori = null)
{
    $builder = $this->select('pemakaian.*, asset.nama_barang, asset.kode_barang, asset.kode_kategori, kategori.nama_kategori, asset.kode_sub_kategori, sub_kategori.nama_sub_kategori, lokasi.nama_lokasi, pengguna.nama_pengguna')
        ->join('asset', 'asset.id = pemakaian.id_asset')
        ->join('kategori', 'kategori.kode_kategori = asset.kode_kategori', 'left')
        ->join('sub_kategori', 'sub_kategori.kode_sub_kategori = asset.kode_sub_kategori', 'left')
        ->join('lokasi', 'lokasi.id = pemakaian.id_lokasi', 'left')
        ->join('pengguna', 'pengguna.id = pemakaian.id_pengguna', 'left');

    if (!empty($tahun) && $tahun !== 'Semua') {
        $builder->where('YEAR(pemakaian.tanggal_mulai)', $tahun);
    }

    if (!empty($kategori) && $kategori !== 'Semua') {
        $builder->where('asset.kode_kategori', $kategori);
    }

    if (!empty($subKategori) && $subKategori !== 'Semua') {
        $builder->where('asset.kode_sub_kategori', $subKategori);
    }

    return $builder->findAll();