app/Models/RiwayatModel.php

    public function getRiwayatWithBarang($id_barang)
    {
        return $this->select('riwayat.*, pengguna.nama_pengguna, barang.nama_barang')
                    ->join('barang', 'barang.id = riwayat.id_barang', 'left')
                    ->join('pengguna', 'pengguna.id = riwayat.id_pengguna', 'left')
                    ->where('riwayat.id_barang', $id_barang)
                    ->findAll();
---
SELECT `riwayat`.*, `pengguna`.`nama_pengguna`, `barang`.`nama_barang`
FROM `riwayat`
LEFT JOIN `barang` ON `barang`.`id` = `riwayat`.`id_barang`
LEFT JOIN `pengguna` ON `pengguna`.`id` = `riwayat`.`id_pengguna`
WHERE `riwayat`.`id_barang` = '229'