app/Models/SubKategoriModel.php

  public function getSubKategoriWithKategori($kategori = null)
{
    $builder = $this->select('sub_kategori.*, kategori.nama_kategori, kategori.kode_kategori, COUNT(barang.id) as jumlah_barang')
                    ->join('kategori', 'kategori.kode_kategori = sub_kategori.kode_kategori')
                    ->join('asset', 'asset.kode_sub_kategori = sub_kategori.kode_sub_kategori', 'left')
                    ->join('barang', 'barang.id_asset = asset.id', 'left')
                    ->groupBy('sub_kategori.kode_sub_kategori');

    if ($kategori !== null) {
        $builder->where('kategori.nama_kategori', $kategori);
    }

    return $builder->findAll();
---
SELECT `sub_kategori`.*, `kategori`.`nama_kategori`, `kategori`.`kode_kategori`, COUNT(CASE WHEN barang.status != "habis terpakai" THEN barang.id END) as jumlah_barang
FROM `sub_kategori`
JOIN `kategori` ON `kategori`.`kode_kategori` = `sub_kategori`.`kode_kategori`
LEFT JOIN `asset` ON `asset`.`kode_sub_kategori` = `sub_kategori`.`kode_sub_kategori`
LEFT JOIN `barang` ON `barang`.`id_asset` = `asset`.`id`
GROUP BY `sub_kategori`.`kode_sub_kategori`